[
{
  "eventName": "Fault Analyzer",
  "eventTime": "",
  "eventVenue": "On Campus",
  "eventDescription":"Fault Analyzer is an engaging competition where participants put their electrical knowledge to the test by identifying and fixing faults in circuits. Teams of 2-3 members will navigate through three exciting rounds that challenge their understanding of electrical components, fault analysis, and circuit applications. Points are awarded for both speed and accuracy, with winners declared based on their overall performance.",
  "eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1728372181/Fault_Analyzer_l2wfxi.png"
},
{
"eventName": "AI of God 3.0",
"eventTime": "10th October",
"eventVenue": "Online",
"eventDescription":"Merge machine learning with computer vision. Develop AI systems to recognize and analyse images from past and present. Focus on tasks like: distinguishing between images from different eras, colorizing black-and-white images, identifying objects from various historical periods",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1728372180/ai_of_god_dqog6i.jpg"
},
{
"eventName": "Mathalon",
"eventTime": "60 minutes",
"eventVenue": "NLHC",
"eventDescription":"Mathalon is an exhilarating competition that pushes participants to their numerical limits, testing their arithmetic, algebra, geometry, aptitude, riddles, and reasoning skills. Teams of three will compete in a series of challenging rounds designed to showcase their mathematical prowess.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001157/28_mp9svt.png"
},
{
"eventName": "Code Conquest",
"eventTime": "60 minutes",
"eventVenue": "Online",
"eventDescription":"Welcome to the ultimate coding challenge, where creativity meets technical prowess! This competition is designed to test your coding skills, problem-solving abilities, and teamwork in a thrilling environment. Participants from various colleges and specializations are invited to form teams and compete for the top position.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1728372181/Code_Conquest_aofkvz.png"
},

{
"eventName": "GeoGuesser",
"eventTime": "90 minutes",
"eventVenue": "Computer Center, NLHC, IIT ISM Dhanbad",
"eventDescription":"GeoGuesser is an exciting 90-minute competition designed to foster geographical and geological knowledge among earth enthusiasts. Participants will test their knowledge of geologically significant landmarks by guessing their locations based on provided images and marking them on Google Earth. The event encourages collaboration, precision, and accuracy in identifying famous natural landmarks around the globe. Teams will be scored based on the accuracy of their guesses.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001158/29_wxjcp5.png"
},

{
"eventName": "Elemental Odyssey",
"eventTime": "60 minutes",
"eventVenue": "On Campus",
"eventDescription":"Elemental Odyssey is an exciting two-round competition that brings together knowledge and strategy, centered around minerals, metals, and their real-world and fictional applications. Participants will engage in a unique quiz and a card game, testing their wits and strategic thinking. This event provides a platform for students passionate about minerals and metals to showcase their skills in an engaging and competitive environment.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001160/33_yvejkg.png"
},
{
"eventName": "Seek the Civil Geek",
"eventTime": "",
"eventVenue": "On Campus",
"eventDescription":"Seek the Civil Geek invites aspiring engineers to tackle real-world challenges through case studies provided by prestigious companies. Participants will analyze intricate civil engineering problems, propose innovative solutions, and present their findings to a distinguished panel of judges. This competition offers a platform for students to showcase their problem-solving skills and deepen their understanding of the civil engineering field.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001193/34_ouylj3.png"
},

  {
"eventName": "Archway",
"eventTime": "90 minutes",
"eventVenue": "On Campus",
"eventDescription":"Archway-Arena is an engaging hands-on competition for aspiring engineers, where participants will design and construct a bridge framework using spaghetti sticks. The challenge is to create a structure that can withstand substantial loads, simulating real-world engineering challenges. This event offers a unique opportunity to blend creativity with engineering principles, fostering innovation and teamwork.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001154/35_wtzkyv.png"
},
{
"eventName": "Logic Mania",
"eventTime": "",
"eventVenue": "On Campus",
"eventDescription":"Logic Mania is an exciting competition where participants solve a series of logic equations using a limited set of logic gates. Teams are challenged to find the most cost-effective solutions while enhancing their logical thinking and problem-solving skills.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001165/12_apun7k.png"
},
{
"eventName": "Retro Rover",
"eventTime": "",
"eventVenue": "On Campus",
"eventDescription":"The Rover Modeling Competition challenges participants to design and model a space land rover using SolidWorks, drawing inspiration from renowned rovers like Curiosity, Perseverance, and Pragyan. The competition consists of two rounds: designing individual parts and assembling those parts into a functional rover.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001165/11_dt4wnn.png"
},
{
"eventName": "Crack the Crude Code",
"eventTime": "3 hours",
"eventVenue": "On Campus",
"eventDescription":"Crack the Crude Code is a hands-on engineering challenge that tests participants' creativity, problem-solving skills, and understanding of mechanical separation principles in petroleum engineering. Teams of 1-4 members will construct a functional shale shaker model using basic materials to filter impurities from a mixture. This event simulates real-world challenges faced in the oil and gas industry, encouraging participants to innovate and think critically while working under time constraints.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001155/36_fxsw45.png"
},
{
"eventName": "PetroMaze",
"eventTime": "2 hours",
"eventVenue": "Petroleum Department",
"eventDescription":"An exciting crossword puzzle competition where teams will test their knowledge of the energy sector! Decode clues related to general knowledge, renewable energy, and emerging technologies, all while racing against the clock. Gather your friends for a fun and challenging event that sharpens your thinking and problem-solving skills.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001156/37_nx9dot.png"
},
{
"eventName": "Nirvana",
"eventTime": "",
"eventVenue": "",
"eventDescription":"",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001156/38_ftfw8h.png"
},
{
"eventName": "Ranneeti",
"eventTime": "12 Oct, 12:00 AM",
"eventVenue": "Online",
"eventDescription":"Teams will analyze, strategize, and present solutions to a real-world business case to a panel of judges. The competition emphasizes creativity, practical implementation, and strategic thinking in management decisions.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001162/32_kuixfk.png"
},
{
"eventName": "The Urban Pulse",
"eventTime": "18 Oct, 12:00 AM",
"eventVenue": "Offline",
"eventDescription":"The Smart Cities Innovation Challenge invites participants to creatively address urban planning and sustainability challenges, promoting innovative and eco-friendly solutions for the cities of tomorrow.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001159/31_v7g0ld.png"
},




{
"eventName": "CHEM-E-CODE",
"eventTime": "",
"eventVenue": "On Campus",
"eventDescription":"CHEM-E-CODE is a competitive coding event tailored  for engineers, combining computational problem-solving with real-world chemical engineering scenarios. The event challenges participants to develop algorithmic solutions for problems related to chemical processes, reaction optimization, and plant operations. It aims to test the participants' programming skills while reinforcing their understanding of core chemical engineering principles.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001158/30_i9smy2.png"
},
{
"eventName": "Ascension Arcade",
"eventTime": "20th Oct,02:00 PM",
"eventVenue": "NLHC",
"eventDescription":"AscensionArcade is an exciting hacking competition designed to test your cybersecurity skills! In Round 1, participants will engage in a command-line-based game, learning essential cybersecurity theory while tackling various challenges. The top teams will advance to Round 2, an onsite hacking challenge where teams will compete to solve as many challenges as possible in the least amount of time. This event offers a platform to showcase your technical skills, creativity, and originality.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001169/19_djntul.png"
},
{
"eventName": "VisionForge 48 ",
"eventTime": "15 Oct, 08:00 PM",
"eventVenue": "Online",
"eventDescription":"VisionForge 48 is a 48-hour design challenge where you will create innovative and user-friendly UI/UX designs based on given prompts or themes. The challenge encourages creativity, problem-solving, and practical design skills. Unleash your creative mind and solve the problems of the real world!",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001169/20_f5tgvq.png"
},






{
"eventName": "CodeRapido",
"eventTime": "20 Oct, 09:00 AM",
"eventVenue": "On Campus",
"eventDescription":"CODERapido is a 200-minute mini-hackathon designed to foster innovation and teamwork among developers. Teams of 1-3 members will compete to create a small game based on a theme revealed at the start of the event. Participants have the freedom to choose any tech stack they prefer. The event aims to encourage collaborative problem-solving, stimulate creative thinking under time constraints, and provide a platform for showcasing technical skills. Teams will develop their projects within the given time frame and present them to a panel of judges for evaluation.",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001169/21_v9bssa.png"
},
{
"eventName": "CryptoGuard CTF",
"eventTime": "19 Oct, 12:00 PM",
"eventVenue": "Library",
"eventDescription":"CryptoGuard is an exciting multi-level Capture the Flag (CTF) competition focused on trending Web3 security challenges. Participants will put their hacking skills to the test by exploiting vulnerabilities in Ethereum smart contracts deployed on the EVM (Ethereum Virtual Machine)",
"eventPosterUrl": "https://res.cloudinary.com/dnywj3xrl/image/upload/v1729001219/22_rysr6i.png"
}
  ]









